var year = 1999     // 정수형 변수
var message = "Hello, World"    // 문자열 변수

let birthYear = 1980    // 정수형 상수
let welcomeMessage = "안녕하세요"    // 문자열 상수

var year1: Int   // 변수 선언
year1 = 1999     // 선언된 변수의 초기화

// 변수의 값 변경하기
var vValue = 3
vValue = 7

var intValue = 3                    // Int 타입으로 초기화
var strValue = "Hello world"        // String 타입으로 초기화

// 영어 및 숫자, 언더바로 정의
var str = "문자열"
var initInt34 = 37
var init_Int = 100


// 한글 및 한글 초성, 중성으로 정의
var 마스터 = "저자"
var ㄹㅂㅍㅇㅍ = "루비페이퍼"
var ㅏㅑㅓㅕㅗ = "아야어여오"

// 이미지 바이너리를 사용하여 정의
var 😀 = "C"
var 😎 = "t"

// 한자를 사용하여 정의
var 韩国 = "한국"
var 品德 = "도덕"

// 위 예를 모두 함께 섞어서 정의
var ㅁab수32🥶 = "이것저것"

// 변수에는 [ +, -, *, / ] 및 공백은 변수에 사용할 수 없다.
// 예약어나 키워드로 등록된 단어는 변수나 상수명에 사용할 수 없다.
// 변수, 상수명의 첫번째 자리에 올 수 없습니다.

Int.max
Int.min

Int64.max
Int64.min

Int32.max
Int32.min

Int16.max
Int16.min

Int8.max
Int8.min


// bool 타입

var close = true

// Bool 타입 저장 상수
let success = true
let fail = false

// String 타입 저장 변수
var projectname = "iOS study"

// String 타입 저장 상수
let language = "swift"






